In [1]:
import pandas as pd;

In [3]:
file = pd.read_csv('./TITANIC_FORMATTED_1.csv');
df = pd.DataFrame(file);
df

,Name,Age,Gender,Class,Fare,Survival
0,"Allen, Miss. Elisabeth Walton",29.0,Female,1st,211.34,Survived
1,"Allison, Master. Hudson Trevor",1.0,Male,1st,151.55,Survived
2,"Allison, Miss. Helen Loraine",2.0,Female,1st,151.55,Died
3,"Allison, Mr. Hudson Joshua Creighton",30.0,Male,1st,151.55,Died
4,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",25.0,Female,1st,151.55,Died
...,...,...,...,...,...,...
1304,"Zabour, Miss. Hileni",15.0,Female,3rd,14.45,Died
1305,"Zabour, Miss. Thamine",NaN,Female,3rd,14.45,Died
1306,"Zakarian, Mr. Mapriededer",27.0,Male,3rd,7.23,Died
1307,"Zakarian, Mr. Ortin",27.0,Male,3rd,7.23,Died
1308,"Zimmerman, Mr. Leo",29.0,Male,3rd,7.88,Died